In [2]:
import pandas as pd
import numpy as np
import seaborn as sb
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')
sb.set_style('whitegrid')

In [128]:
test = pd.read_csv('Test_0qrQsBZ.csv')
train = pd.read_csv('Train_SU63ISt.csv')

In [15]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5112 entries, 0 to 5111
Data columns (total 2 columns):
ID          5112 non-null int64
Datetime    5112 non-null object
dtypes: int64(1), object(1)
memory usage: 59.9+ KB

In [16]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18288 entries, 0 to 18287
Data columns (total 3 columns):
ID          18288 non-null int64
Datetime    18288 non-null object
Count       18288 non-null int64
dtypes: int64(2), object(1)
memory usage: 357.2+ KB

In [129]:
test['Datetime'] = pd.to_datetime(test['Datetime'])

In [130]:
train['Datetime'] = pd.to_datetime(train['Datetime'])

In [32]:
test['Hour'] =  test['Datetime'].apply(lambda x:x.hour)

In [37]:
train['Hour'] =  train['Datetime'].apply(lambda x:x.hour)

In [31]:
test['Year'] = test['Datetime'].apply(lambda x:x.year)

In [33]:
train['Year'] = train['Datetime'].apply(lambda x:x.year)

In [43]:
train.tail()

          ID            Datetime  Count  Year  Hour  Month
18283  18283 2014-09-25 19:00:00    868  2014    19      9
18284  18284 2014-09-25 20:00:00    732  2014    20      9
18285  18285 2014-09-25 21:00:00    702  2014    21      9
18286  18286 2014-09-25 22:00:00    580  2014    22      9
18287  18287 2014-09-25 23:00:00    534  2014    23      9

In [41]:
train['Month']= train['Datetime'].apply(lambda x:x.month)

In [42]:
test['Month']= test['Datetime'].apply(lambda x:x.month)

In [46]:
train['Date']=train['Datetime'].apply(lambda x:x.day)

In [47]:
test['Date']=test['Datetime'].apply(lambda x:x.day)

In [103]:
train.tail()

          ID            Datetime  Count  Year  Hour  Month  Date
18283  18283 2014-09-25 19:00:00    868  2014    19      9    25
18284  18284 2014-09-25 20:00:00    732  2014    20      9    25
18285  18285 2014-09-25 21:00:00    702  2014    21      9    25
18286  18286 2014-09-25 22:00:00    580  2014    22      9    25
18287  18287 2014-09-25 23:00:00    534  2014    23      9    25

In [102]:
test.tail()

         ID            Datetime  Hour  Year  Month  Date
5107  23395 2015-04-26 19:00:00    19  2015      4    26
5108  23396 2015-04-26 20:00:00    20  2015      4    26
5109  23397 2015-04-26 21:00:00    21  2015      4    26
5110  23398 2015-04-26 22:00:00    22  2015      4    26
5111  23399 2015-04-26 23:00:00    23  2015      4    26

In [131]:
pd.pivot_table(data = train, index = 'ID', columns= '')

       Count
ID
0          8
1          2
2          6
3          2
4          2
5          2
6          2
7          2
8          6
9          2
10         2
11         6
12         4
13         2
14         6
15         2
16         2
17         2
18         2
19         2
20         2
21         6
22         2
23         2
24         4
25         6
26         2
27         4
28         2
29         2
...      ...
18258    966
18259   1178
18260   1008
18261    936
18262    848
18263    942
18264    686
18265    546
18266    550
18267    416
18268    344
18269    334
18270    416
18271    498
18272    482
18273    512
18274    724
18275    656
18276    672
18277    642
18278    616
18279    686
18280    654
18281    622
18282    680
18283    868
18284    732
18285    702
18286    580
18287    534

[18288 rows x 1 columns]

In [105]:
data.tail()

       Count  Date  Hour  Month  Year
ID
18283    868    25    19      9  2014
18284    732    25    20      9  2014
18285    702    25    21      9  2014
18286    580    25    22      9  2014
18287    534    25    23      9  2014

In [75]:
from sklearn.model_selection import train_test_split

In [109]:
X = data.drop(['Count'], axis= 1)
y = data['Count']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [110]:
from sklearn.linear_model import LinearRegression

In [111]:
lin = LinearRegression()

In [112]:
lin.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [113]:
pred = lin.predict(X_test)

In [114]:
lin.score(X_test, y_test)

0.5367776287022474

In [115]:
from sklearn.metrics import mean_squared_error

In [116]:
np.sqrt(mean_squared_error(y_test, pred))

103.85583259479607

In [118]:
X_train = data.drop(['Count'], axis= 1)
y_train = data['Count']
X_test = test.drop(['ID', 'Datetime'], axis = 1)

In [119]:
lin.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [120]:
pred = lin.predict(X_test)

In [125]:
pred

array([-322173.18410044, -322171.83509502, -322170.48608961, ...,
       -322194.14560428, -322192.79659886, -322191.44759344])